[
    {
      "image": "./images/images/projects/popNow.jpg",
      "name":       "pdx Pop Now",
      "description": "I was able to contribute to a full stack React app that curates an artist directory for the non-profit PDX Pop Now! My focus was on creating the UI and curating an artist filter search bar. Users can easily look through local artist’s profiles and discover bands/singers by genres as well! There is also sign up functionality that lets artists create and easily update their profiles.",
      "challenges":  ["Communication was crucial", "Code would often break after we pushed and made a pull request.", "researching how to go about functions I was in charge of and browsing through the hundreds of methods."],
      "takeAways":   ["You cannot build a beautiful website without any thought out prototypes.", " pay close attention to code when reviewing pull request and make sure not to delete anything important.", "Be clear on who's doing what within your team" ],
      "link": "https://pdxpopnow.netlify.com/",
      "goals":{

      }
    },
    {
      "image": "./images/images/projects/drank.jpg",
      "name":       "Cocktail App",
      "description":    "We all get tired of the same old basic mix and some of us aren't to saavy to know what to mix. This app helps you out by taking what you already have in your fridge along with your spirit of choice and gives you ideas on new drinks you can make using what you already have at home!",
      "challenges":      ["Communication was crucial", "Code would often break after we pushed and made a pull request.", "researching how to go about functions I was in charge of and browsing through the hundreds of methods."],
      "takeAways":   ["You cannot build a beautiful website without any thought out prototypes.", " pay close attention to code when reviewing pull request and make sure not to delete anything important.", "Be clear on who's doing what within your team" ],
      "link": "alcodeholics_anonymous/index.html",
      "goals":{

      }
    },
    {
      "image": "./images/images/projects/chart.jpg",
      "name":       "Data Analysis",
      "description":    "Data analysis app that determines which pictures are most appealing to the viewer. User has to click on 1 of 3 images 15 times, which will then populate a chart ranking the chosen images from most clicked to least clicked.",
      "challenges":     ["Trying to figure out method of displaying images at a time, without displaying the same image more than once in an instance", "Figuring out the math to Display a progress bar so that the user knows how many more clicks.", "Linking the chart like any other style page or script page would be easy, but the script for Bus Mall had to be tweaked in order for numbers and names of images to display properly." ],
      "takeAways":    ["First time tapping into local storage and using JSON.", "First time using a library to populate the chart.(https://canvasjs.com/)", "Tapped into css transitions in order to enhance the feel of the website." ],
      "link": "https://github.com/cruzayye/bus-mall/tree/master"
    },
    {
      "image": "./images/images/projects/cookies.jpg",
      "name":       "Cookie Store",
      "description":    "This application displays data for a small business running a cookie store in 6 different locations. numbers are generated by a random number generator function which takes a maximum number of customers that could potentially come in and minimum number of customers and multiplies it by the Math.Random js global method. Users are able to create their own stores to see how successful or lucky their business gets.",
      "challenges":     ["Needed to figure out an algorithm which took a minimum number, maximum number and and average number of cookies in order to come up with a new number of cookies sold per hour whenever the page is refreshed.", "Tables are already complex enough, figuring out how to use the DOM in order to display information with a table is another story.", "Provided a form for the store owner to add another store and input numbers that would populate a new table for them." ],
      "takeAways":    ["Style guides ar an essential medium of displaying how someone else should understand your css.", "DOM manipulation is how we can take websites to the next level displaying data, elements and pretty much anything that isn't static", "Tapped into css transitions in order to enhance the feel of the website." ],
      "link": "https://github.com/cruzayye/cookie-stand/tree/class09"
    },
    {
      "image": "./images/images/projects/bstarrs.png",
      "name": "barberstarrs",
      "description":    "This was my very first project where I didn't use a CMS(wordpress) to build a web page. This was also my very first time dabbling with Bootstrap. I've come to realize that I prefer to utilize CSS Grid over a framework because of it's flexibility towards creating easy, responsive layouts. This project was heavily design based. Some extra tools used to build this page, were Illustrator to creat some vectore images, as well as Photoshop",
      "challenges":   ["Since this was my very first freelance I had no idea what to charge so I told my client that if he was pleased with the site he could use it, otherwise he could just disregard it. I didn't think this would go through, but everything worked out.", "Figuring out how to set up a database for the form, instead of just relying on the users email browser.", "I had started this project before starting school at Alchemy Code Lab, so a lot of my knowledge was gained online." ],
      "takeAways":["Now that I know about css grid I dont think I'll be using Bootstrap unless required to. Theres a lot more freedom and control when creating your own grid.", " The HTML in this project contains several divs which is a NO NO!", "This project pushed to use SFTP instead of FTP when uploading the site to the host. Theres no readson to be using FTP" ],
      "link": "http://www.barberstarrs.com/"
      
    },
    {
      "name": "designs",
      "description": "This is a collection of my graphic design work. I originally went to school for graphic design. I was able to do a few freelance projects, but I felt like I needed to learn how to work with websites in order to take my creativity to the next level.",
      "challenges":   ["This was a fast paced course and I was new to this field, like any other program the learning curve took lots of practice.", "Biggest challenge about working with other designers getting on the same page when design style differ heavily.", "One of the courses was an intro to web design which required us to create an online portfolio with html and css. This was my first time looking at code and a lot more technical than the design work we had been used to." ],
      "takeAways":    ["I have become efficient in the Adobe Creative Cloud including Photoshop, Illustrator, Indesign and After Effects.", "Because of my graphic design experienced I've realized that websites/apps are more than having a functional program. Design plays a major role for the user's experience.", "Whether it's design or programming both have similarities as far as the process goes.  A plan must be initialized in order to avoid issues down the road. " ],
      "link": ""
      
    },
    {
      "image": "./images/images/projects/nobalanceDisplay.png",
      "name":       "No Balance",
      "description":    "Designed logo, business card and built a website through Wordpress for a local startup productions company that produces and edits videos",
      "challenges":   ["This was a fast paced course and I was new to this field, like any other program the learning curve took lots of practice.", "Biggest challenge about working with other designers getting on the same page when design style differ heavily.", "One of the courses was an intro to web design which required us to create an online portfolio with html and css. This was my first time looking at code and a lot more technical than the design work we had been used to." ],
      "link": "http://www.nobalanceproductions.com/"
      
    },
    {
      "image": "./images/images/projects/h2Display.png",
      "name":"h2+",
      "description": "Developed product concept along, which includes a logo, packaging, stationary, web page and touch points. H2+ is an all natural healthy energy drink.",
      "challenges":   ["This was a fast paced course and I was new to this field, like any other program the learning curve took lots of practice.", "Biggest challenge about working with other designers getting on the same page when design style differ heavily.", "One of the courses was an intro to web design which required us to create an online portfolio with html and css. This was my first time looking at code and a lot more technical than the design work we had been used to." ],
      "link": "./h2.html"
      
    },
    {
      "image": "./images/images/projects/1859.png",
      "name":"magazine",
      "description": "Mock layout for a magazine company based out of Portland, OR. This mock includes a layout for the features page and for the department's page, along with a layout design for an article. ",
      "challenges":   ["This was a fast paced course and I was new to this field, like any other program the learning curve took lots of practice.", "Biggest challenge about working with other designers getting on the same page when design style differ heavily.", "One of the courses was an intro to web design which required us to create an online portfolio with html and css. This was my first time looking at code and a lot more technical than the design work we had been used to." ],
      "link": "./magazine.html"
      
    },
    {
      "image": "./images/images/projects/cookbookDisplay.png",
      "name":"cookbook",
      "description": "Designed a multi-paged book using advanced features in InDesign. Followed guidelines of an online book creator for proper printing. Photo editing was done in photoshop. The book layout was composed in InDesign incorporating master pages.",
      "challenges":   ["This was a fast paced course and I was new to this field, like any other program the learning curve took lots of practice.", "Biggest challenge about working with other designers getting on the same page when design style differ heavily.", "One of the courses was an intro to web design which required us to create an online portfolio with html and css. This was my first time looking at code and a lot more technical than the design work we had been used to." ],
      "link": "./cookbook.html"      
    },
    {
      "image": "./images/bw/kermit.jpg",
      "name":"Meme Generator",
      "description": "This was one of my first times experimenting with React. This small app lets meme lovers create their own memes as well as download the final outcome of the image. Simply fill out the form, download and go viral! (in order for an image to populate, you must copy an image url from another site)",
      "challenges":   ["This was a fast paced course and I was new to this field, like any other program the learning curve took lots of practice.", "Biggest challenge about working with other designers getting on the same page when design style differ heavily.", "One of the courses was an intro to web design which required us to create an online portfolio with html and css. This was my first time looking at code and a lot more technical than the design work we had been used to." ],
      "link": "./meme-generator/dist/index.html"   
    },
    {
      "image": "./images/images/projects/popup.jpg",
      "name":"popup",
      "description": "A restful API, for people who love food and events that revolve around food. Our goal was to create a social platform around the food culture so that Restaurants/chefs could post details for their events and people could easily know about them in advance. Node Js was used as the back end platform, as well as Mongo-DB",
      "challenges": ["This was a fast paced course and I was new to this field, like any other program the learning curve took lots of practice.", "Biggest challenge about working with other designers getting on the same page when design style differ heavily.", "One of the courses was an intro to web design which required us to create an online portfolio with html and css. This was my first time looking at code and a lot more technical than the design work we had been used to." ],
      "link": "https://github.com/team-ramen-tics"   
    },
    {
      "image": "./images/images/projects/wpThemeLink.jpg",
      "name":"wordpressTheme",
      "description": "Very first time diving into developing a Worpress Theme. Some new tools I picked up were: PHP, a backend language which is heavily used for Wordpress. Flywheel, used to test out the local development code when working on a wordpress theme.",
      "challenges": ["This was a fast paced course and I was new to this field, like any other program the learning curve took lots of practice.", "Biggest challenge about working with other designers getting on the same page when design style differ heavily.", "One of the courses was an intro to web design which required us to create an online portfolio with html and css. This was my first time looking at code and a lot more technical than the design work we had been used to." ],
      "link": "http://wild.designercode.me"   
    }
    

]
